package Homework.Homework_19;

public class MathOperationOne {
    /**
     * Задача 1: Напишите метод, который принимает два целых числа в качестве аргументов
     * и возвращает их сумму.
     * Пример: add(5, 7) -> 12
     */
    public static void main(String[] args) {
        System.out.println("Сумма чисел равна: " + add(-5, 2));
    }
    public static int add(int a, int b) {
        return a + b;
    }
}
