package Homework.lesson_20;
/*Задачи:
Создание и Инициализация Массива:

Создайте массив целых чисел размером 10 элементов.
Инициализируйте массив случайными числами от 1 до 100.
Сортировка и Поиск:*/

/*Используйте Arrays.sort() для сортировки массива.
Найдите максимальное и минимальное значения в массиве.
Изменение и Вывод:*/

/*Умножьте каждый элемент массива на число 2.
Выведите исходный и измененный массивы в консоль.
Копирование и Сравнение:*/

/*Создайте копию исходного массива используя Arrays.copyOf().
Сравните исходный массив и его копию с помощью Arrays.equals() и выведите результат сравнения.
Дополнительно: Попробуйте реализовать собственный алгоритм сортировки (например, сортировку пузырьком).*/


public class task1 {
    public static void main(String[] args) {

    }
}
