// Напишите программу, которая выводит числа от 1 до 10:
//
//    С использованием while.

package Practice.Practice_17;

public class PrintNumbersWhile {
    public static void main(String[] args) {
        int i = 1;
        // Используем цикл while для вывода чисел от 1 до 10.
        while (i <= 10) {
            System.out.println(i);
            i++;
        }
    }
}
