// Напишите программу, которая выводит числа от 1 до 10:
//
//    С использованием for.

package Practice.Practice_17;

public class PrintNumbersFor {
    public static void main(String[] args) {
        // Используем цикл for для вывода чисел от 1 до 10.
        for (int i = 1; i <= 10; i++) {
            System.out.println(i);
        }
    }
}
