package Lessons.Lesson_20;

/**
 *  Формирование Максимального Числа из Строки
 *
 *  Задачи:
 * Программа Преобразования Строки в Максимальное Число:
 * Напишите программу, которая принимает число в виде строки.
 * Программа должна выводить максимально возможное число, которое можно составить из цифр входной строки.
 * Если входная строка уже представляет собой максимальное число, программа должна вывести -1.
 * Примеры Ввода и Вывода:
 * Ввод: "123" -> Вывод: 321
 * Ввод: "921" -> Вывод: -1
 * Ввод: "912" -> Вывод: 921
 *
 * Детали Реализации:
 * 1. Конвертация Строки в Массив:
 *   - Преобразуйте входную строку в массив цифр.
 * 2. Обработка и Сортировка:
 *   - Отсортируйте массив цифр в убывающем порядке.
 * 3. Формирование Результата:
 *   - Сформируйте число из отсортированных цифр и сравните его с исходной строкой.
 *   - Если число совпадает с исходной строкой, верните -1.
 *   - В противном случае, верните сформированное число.
 * 4. Вывод Результата:
 *   - Программа должна выводить результат в консоль.
 */


public class PracticeArray {
    public static void main(String[] args) {

    }
}
