//Задача 1: Программа "Hello, World!"
//Напишите программу на Java, которая выводит на консоль "Hello, World!".
// Убедитесь, что ваш код соответствует правильной структуре класса и метода main.
package Practice.Practice_19;

public class SayHelloWorld {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}
