package Practice.Practice_19;

public class SimpleCycle {
    /**
     * Задача 5: Простой цикл
     * <p>
     * Напишите программу, которая выводит числа от 1 до 10, используя цикл for.
     */
    public static void main(String[] args) {
        for (int i = 1;  i <= 10; i++) {
            System.out.println(i);
        }
    }
}
