package Homework.lesson_22;
/*Дополнительное задание (необязательное, для продвинутых студентов)
Создать новый класс Store, который управляет списком товаров (Product). Реализовать:

Поле products (список товаров).
Метод addProduct(Product product), который добавляет товар в магазин.
Метод displayAllProducts(), который выводит список всех товаров.
Метод findMostExpensiveProduct(), который возвращает самый дорогой товар.
Протестировать, создав Store и добавив несколько товаров.*/
public class Store22 {



}
